early_models/hm_cases_new/hm_sa/backGround/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         5.5;

deltaT          2e-3;

writeControl    adjustableRunTime;

writeInterval   1e-2;

purgeWrite      0;

writeFormat     ascii;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   10;

runTimeModifiable true;

/*adjustTimeStep  yes;

maxCo           1;

maxDeltaT       0.1;*/


// ************************************************************************* //

functions
{
///////////////////////////////////////////////////////////////////////////

    forces_object
    {
	type forces;
	libs ("libforces.so");
	patches (wing);

	writeControl writeTime;
	
        //writeControl   timeStep;
	//writeInterval  1;

	//// Name of fields
	pName    p;
	UName    U;

	//// Density
	rho rhoInf;
	rhoInf 1;

	//// Centre of rotation
	CofR (0 0 0);
    }

///////////////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////////////

    forceCoeffs_object
    {
	// rhoInf - reference density
	// CofR - Centre of rotation
	// dragDir - Direction of drag coefficient
	// liftDir - Direction of lift coefficient
	// pitchAxis - Pitching moment axis
	// magUinf - free stream velocity magnitude
	// lRef - reference length
	// Aref - reference area
	type forceCoeffs;
	libs ("libforces.so");
	patches (wing);

	writeControl writeTime;
        //writeControl   timeStep;
        //writeInterval  1;

	pName p;
	Uname U;

	rho rhoInf;
	rhoInf 1;

	//// Dump to file
	log true;

	CofR (0 0 0);
	liftDir (1 0 0);
	dragDir (0 0 1);
	pitchAxis (0 1 0);
	magUInf 14.2377;
	lRef 1.0;         // reference lenght for moments!!!
	Aref 3.09;	// reference area
    }

///////////////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////////////

    fieldAverage
    {
        type           fieldAverage;
        libs ("libfieldFunctionObjects.so");
        enabled        true;
        writeControl   writeTime;

	//writeControl   timeStep;
	//writeInterval  100;

	//cleanRestart true;

	//timeStart       20;
	//timeEnd         200;

        fields
        (
            U
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }

            p
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }
        );
    }

///////////////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////////////

    minmaxdomain
    {
	type fieldMinMax;
	//type banana;

	libs ("libfieldFunctionObjects.so");
	enabled true;

	mode component;

	writeControl writeTime;
	//writeControl timeStep;
	//writeInterval 1;

	log true;

	fields (p U);
    }

///////////////////////////////////////////////////////////////////////////

};

